Config/Catalogs/ПоставкиФорматовОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоставкиФорматовОбменаБанкиКС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/СоставПоставокФорматовОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставПоставокФорматовОбменаБанкиКС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключенВПоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставкиФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ПоставкиФорматовОбменаБанкиКС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ИдентификаторПоставки = "urn:delivery-1c-ru:exchange:format/";	
	КонецЕсли;
	//Объект.ДополнительныеСвойства.Вставить("ИсточникКопирования", Параметры.ЗначениеКопирования);
	// ВерсионированиеОбъектов
	ИсточникКопирования = Параметры.ЗначениеКопирования;
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИсточникКопирования) Тогда
	
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	СоставПоставокФорматовОбменаБанкиКССрезПоследних.ФорматОбмена КАК Ссылка
			|ИЗ
			|	РегистрСведений.СоставПоставокФорматовОбменаБанкиКС.СрезПоследних(&Дата, Поставка = &Поставка) КАК СоставПоставокФорматовОбменаБанкиКССрезПоследних
			|ГДЕ
			|	СоставПоставокФорматовОбменаБанкиКССрезПоследних.ВключенВПоставку
			|	И НЕ СоставПоставокФорматовОбменаБанкиКССрезПоследних.ФорматОбмена.ПометкаУдаления
			|";

		Запрос = Новый Запрос(ТекстЗапроса);
			
		Запрос.УстановитьПараметр("Поставка", ЭтаФорма.ИсточникКопирования);
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());	
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись = РегистрыСведений.СоставПоставокФорматовОбменаБанкиКС.СоздатьМенеджерЗаписи();
			
			НоваяЗапись.Поставка         = ТекущийОбъект.Ссылка;
			Новаязапись.ФорматОбмена     = Выборка.Ссылка;
			НоваяЗапись.ВключенВПоставку = Истина;
			НоваяЗапись.Период           = ТекущаяДата();
			
			НоваяЗапись.Записать(Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
